<?php

/*Задача 4. Создайте две глобальные переменные и присвойте им в качестве значений числа.
Затем создайте пользовательскую функцию, которая будет выводить сумму значений этих глобальных переменных
(используйте ключевое слово global). Выведите результат сложения на экран */
    $a = 1;
    $b = 2;
        function mult_func() {
        global $a;
        global $b;
        $result = $a + $b;
        return $result;
        }
    echo mult_func();

/*Задача 5. Создайте глобальную переменную $a и присвойте ей число 1. Затем создайте пользовательскую функцию,
внутри которой создайте локальную статическую переменную $b и присвойте ей число 0. Далее увеличьте текущее
значение локальной переменной $b на величину значения глобальной переменной $a, т.е. прибавьте к текущему
значению переменной $b значение глобальной переменной $a. Добавьте инструкцию вывода значения переменной $b на экран.
После создания функции вызовите ее три раза и объясните результат. */
    $a = 1;
    function my_func() {
        global $a;
        static $b = 0;
        $b = $b + $a;
        echo $b;
    }
    my_func();
    echo '<br>';
    my_func();
    echo '<br>';
    my_func();

/*Задача 6. Создайте три переменные. Удалите при помощи функции unset() первую переменную и попробуйте вывести ее значение
на экран. Удалите одновременно оставшиеся переменные, передав их функции в качестве аргументов через запятую.
Попробуйте вывести их значения на экран. */
    $a = 1;
    $b = 2;
    $c = 3;
    unset($a);
    echo $a;
    //Не выведет ничего, переменной больше не существует
    unset($b, $c);
    echo $b;
    echo $c;
    //Не выведет ничего, переменных больше не существует

/*Задача 9.
Создайте пользовательскую функцию, которая принимает два аргумента, а возвращает их произведение. 
Вызовите функцию, передав ей в качестве аргументов два числа и выведите на экран результат*/
    function mult_func($arg_1, $arg_2) {
        $result = $arg_1 * $arg_2;
        return $result;
    }
    echo mult_func(4, 3);




?>
